Tekla Open API Reference for Tekla Structures 2025
GraphicsDrawer Constructor
 Creates a new graphics drawer instance.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GraphicsDrawer()
Public Sub New
See Also
Reference
GraphicsDrawer Class
Tekla.Structures.Model.UI Namespace